Revit 2024 API
PlanViewRange.Current Property
 View range for the current plane
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public static ElementId Current { get; }
Visual Basic
Public Shared ReadOnly Property Current As ElementId
	Get
Visual C++
public:
static property ElementId^ Current {
	ElementId^ get ();
}
See Also
PlanViewRange Class
Autodesk.Revit.DB Namespace